[A_heal_immunity H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="Невосприимчивость к магии"
mTooltip="Существо не может быть целью негативных заклинаний или эффектов любой школы магии. Весь магический урон от вражеских атак снижен на 50%."

[Anti_heal.A_IceStrike_Buff H7BaseBuff]
mName="Застывшее исцеление"
mTooltip="Существо больше не может получать лечение или лечить себя. Длительность (ходов): %durnow. (Не действует на конструктов)."

[Anti_heal.A_Nova H7HeroAbility]
mTooltipMagicGuild="Выбранное существо больше не может получать лечение или лечить себя. (Не действует на конструктов)."
mTooltipMagicGuildRankLine="Наносит %d ед. урона от %icon_water магии воды. Выбранные существа в области 4х4 больше не могут получать лечение или лечить себя в течение %buff1.buff.durini ходов. (Не действует на конструктов)."
mTooltipUpgraded="Наносит %d ед. урона от %icon_water магии воды. Выбранные существа в области 4х4 больше не могут получать лечение или лечить себя в течение %buff1.buff.durini ходов. (Не действует на конструктов)."
mName="Застывшее исцеление"
mTooltip="Наносит %d ед. урона от %icon_water магии воды. Существо больше не может быть вылечено. Длительность (ходов): %buff1.buff.durini. (Не действует на конструктов)."